src/cf/src/DataProcessors/АРМЗакупки/АРМЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМЗакупки</name>
  <comment>Рабочее место менеджера по закупкам: заказы поставщикам, их поставка и оплата (docs/plans/arm-purchasing.md).</comment>
</mdclass:DataProcessor>

src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ДвиженияПоКассе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияПоКассе</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипыДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыЗаказовПоставщику/ВидыЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаказовПоставщику</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Предварительный</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СтатусыЗаказовПоставщику/СтатусыЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПоставщику</name>
  <comment>Вычисляемый статус заказа поставщику для отбора и представления в рабочем месте закупок; в регистры не пишется.</comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПоставки</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПоступил</name>
  </enumValues>
  <enumValues>
    <name>Поступил</name>
  </enumValues>
  <enumValues>
    <name>Перенесен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыДвиженияДенежныхСредств/ТипыДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ВозвратПоставщику/ВозвратПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратПоставщику</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСвязанныхДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/АРМЗакупки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Отборы панели рабочего места закупок.
//
// Возвращаемое значение:
//  Структура:
//   * Поставщик      - СправочникСсылка.Контрагенты, Неопределено - поставщик заказа.
//   * Товар          - СправочникСсылка.Номенклатура, Неопределено - товар в строках заказа.
//   * Статус         - ПеречислениеСсылка.СтатусыЗаказовПоставщику, Неопределено - вычисляемый статус.
//   * ПериодПоставки - СтандартныйПериод, Неопределено - дата поставки заказа.
//   * Ответственный  - СправочникСсылка.Пользователи, Неопределено - ответственный заказа.
//   * ВидЗаказа      - ПеречислениеСсылка.ВидыЗаказовПоставщику, Неопределено - пустой: все, кроме предварительных
//                      (решение владельца 2026-10-07).
//
Функция НовыеОтборы() Экспорт

	Отборы = Новый Структура;
	Отборы.Вставить("Поставщик", Неопределено);
	Отборы.Вставить("Товар", Неопределено);
	Отборы.Вставить("Статус", Неопределено);
	Отборы.Вставить("ПериодПоставки", Неопределено);
	Отборы.Вставить("Ответственный", Неопределено);
	Отборы.Вставить("ВидЗаказа", Неопределено);
	Возврат Отборы;

КонецФункции

// Страница списка заказов поставщикам: статус считается до деления на страницы, поэтому отбор по статусу и счётчик
// записей согласованы (план docs/plans/arm-purchasing.md, «Статус и индикатор»).
//
// Параметры:
//  Отборы         - Структура - см. НовыеОтборы.
//  НомерСтраницы  - Число - запрошенная страница, нумерация с единицы; приводится к границам.
//  РазмерСтраницы - Число - заказов на странице.
//
// Возвращаемое значение:
//  Структура:
//   * Всего         - Число - заказов с учётом отборов.
//   * ВсегоСтраниц  - Число - не меньше единицы.
//   * НомерСтраницы - Число - страница в границах 1..ВсегоСтраниц.
//   * Строки        - Массив из Структура - строки страницы от новых к старым, см. НоваяСтрокаЗаказа.
//
Функция СтраницаЗаказов(Отборы, Знач НомерСтраницы, Знач РазмерСтраницы) Экспорт

	// Размер и номер приходят с клиента: неверные значения не должны ронять запрос (ПЕРВЫЕ, деление).
	РазмерСтраницы = Мин(МаксимумСтраницы(), Макс(1, Цел(?(ТипЗнч(РазмерСтраницы) = Тип("Число"), РазмерСтраницы, 1))));
	НомерСтраницы = Цел(?(ТипЗнч(НомерСтраницы) = Тип("Число"), НомерСтраницы, 1));

	ОтборыЗапроса = НовыеОтборы();
	Если ТипЗнч(Отборы) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ОтборыЗапроса, Отборы);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаСтатусов(Запрос, ОтборыЗапроса);
	Запрос.Выполнить();

	// Условие статуса подставляется на место параметра-заглушки: текст запроса остаётся разбираемым конструктором.
	УсловиеСтатуса = "ИСТИНА";
	Если ТипЗнч(ОтборыЗапроса.Статус) = Тип("ПеречислениеСсылка.СтатусыЗаказовПоставщику")
		И ЗначениеЗаполнено(ОтборыЗапроса.Статус) Тогда
		УсловиеСтатуса = "Док.Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", ОтборыЗапроса.Статус);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Всего
	|ИЗ
	|	ВТСтатусы КАК Док
	|ГДЕ
	|	&УсловиеСтатуса", "&УсловиеСтатуса", УсловиеСтатуса);
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = 0;
	Если Выборка.Следующий() Тогда
		Всего = Выборка.Всего;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Всего", Всего);
	Результат.Вставить("ВсегоСтраниц", Макс(1, Цел((Всего + РазмерСтраницы - 1) / РазмерСтраницы)));
	Результат.Вставить("НомерСтраницы", Мин(Макс(1, НомерСтраницы), Результат.ВсегоСтраниц));
	Результат.Вставить("Строки", Новый Массив);
	Если Всего = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	ПараметрыСтраницы = РаботаСДокументамиКлиентСервер.ПараметрыВыборкиСтраницы(Результат.НомерСтраницы,
		Результат.ВсегоСтраниц, РазмерСтраницы, Всего);
	ТекстСтраницы = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.Статус КАК Статус,
	|	Док.Заказано КАК Заказано,
	|	Док.Пришло КАК Пришло,
	|	Заказы.Номер КАК Номер,
	|	Заказы.Контрагент КАК Поставщик,
	|	Заказы.ДатаПоставки КАК ДатаПоставки,
	|	Заказы.Сумма КАК Сумма,
	|	Заказы.Валюта КАК Валюта,
	|	Заказы.Основание КАК ЗаказКлиента,
	|	Заказы.Ответственный КАК Ответственный,
	|	Заказы.ВидЗаказа КАК ВидЗаказа
	|ИЗ
	|	ВТСтатусы КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказы
	|		ПО Док.Ссылка = Заказы.Ссылка
	|ГДЕ
	|	&УсловиеСтатуса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата УБЫВ,
	|	Док.Ссылка";
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(ПараметрыСтраницы.КоличествоСтрок, "ЧГ="));
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, "&УсловиеСтатуса", УсловиеСтатуса);
	Запрос.Текст = СтрЗаменить(ТекстСтраницы, "Док.Дата УБЫВ,
	|	Док.Ссылка", ПараметрыСтраницы.Порядок);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	// Порядок строк задаёт запрос: пересортировка таблицы не устойчива при равных датах и задвоила бы строки на границе
	// страниц. Обычная страница - пропуск первых строк, последняя читается с конца (ПараметрыВыборкиСтраницы) -
	// разворот.
	СтрокиСтраницы = Новый Массив;
	Для Индекс = ПараметрыСтраницы.НачальныйИндекс По Выгрузка.Количество() - 1 Цикл
		СтрокиСтраницы.Добавить(Выгрузка[Индекс]);
	КонецЦикла;
	Если Результат.НомерСтраницы = Результат.ВсегоСтраниц Тогда
		Развернутые = Новый Массив;
		Для Каждого Строка Из СтрокиСтраницы Цикл
			Развернутые.Вставить(0, Строка);
		КонецЦикла;
		СтрокиСтраницы = Развернутые;
	КонецЕсли;

	Ссылки = Новый Массив;
	Для Каждого Строка Из СтрокиСтраницы Цикл
		Ссылки.Добавить(Строка.Ссылка);
	КонецЦикла;
	Оплаты = ОплатыЗаказов(Ссылки);
	Для Каждого Строка Из СтрокиСтраницы Цикл
		СтрокаЗаказа = НоваяСтрокаЗаказа();
		ЗаполнитьЗначенияСвойств(СтрокаЗаказа, Строка);
		СтрокаЗаказа.Заказ = Строка.Ссылка;
		Оплата = Оплаты.Получить(Строка.Ссылка);
		СтрокаЗаказа.Индикатор = КружокПоставки(Строка.Статус, Строка.Заказано, Строка.Пришло)
			+ КружокОплаты(Оплата);
		Результат.Строки.Добавить(СтрокаЗаказа);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Оплата заказов поставщикам по их проведённым поступлениям, в основной валюте. Платёж, выписанный на поступление,
// остаётся оплатой этого поступления и после налоговой накладной покупки; платёж прямо на накладную делится между
// покрытыми ею поступлениями в доле покрытия (план, «Статус и индикатор»).
//
// Параметры:
//  Заказы - Массив из ДокументСсылка.ЗаказПоставщику - заказы.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - ДокументСсылка.ЗаказПоставщику - заказ.
//   * Значение - Структура:
//     ** СуммаПоступлений - Число - сумма проведённых поступлений по заказу в основной валюте.
//     ** Оплачено         - Число - оплачено поставщику по этим поступлениям, за вычетом возвратов денег.
//
Функция ОплатыЗаказов(Заказы) Экспорт

	Результат = Новый Соответствие;
	Если Заказы.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = ЗапросОплат(Заказы);
	Запрос.Текст = "ВЫБРАТЬ
	|	Поступления.Заказ КАК Заказ,
	|	СУММА(Поступления.Сумма) КАК СуммаПоступлений,
	|	СУММА(ЕСТЬNULL(Оплаты.Оплачено, 0)) КАК Оплачено
	|ИЗ
	|	ВТПоступления КАК Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплатыПоступлений КАК Оплаты
	|		ПО Поступления.Поступление = Оплаты.Поступление
	|
	|СГРУППИРОВАТЬ ПО
	|	Поступления.Заказ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Оплата = Новый Структура("СуммаПоступлений, Оплачено", Выборка.СуммаПоступлений, Выборка.Оплачено);
		Результат.Вставить(Выборка.Заказ, Оплата);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Данные нижних закладок по заказу поставщику: только чтение (сборка 2.0.16.28).
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПоставщику - текущий заказ.
//
// Возвращаемое значение:
//  Структура:
//   * Товары      - ТаблицаЗначений - Номенклатура, Характеристика, Заказано, Пришло, Осталось, Цена, Сумма, Продукция.
//   * Поступления - ТаблицаЗначений - Документ, Дата, НомерНакладной, ДатаНакладной, Номенклатура, Характеристика,
//                   Количество, Сумма, Статус.
//   * Оплаты      - ТаблицаЗначений - Документ, Дата, Основание, Сумма.
//   * Документы   - ТаблицаЗначений - Документ, Вид, Номер, Дата, Сумма, Статус.
//   * Сальдо      - Строка - сальдо расчётов с поставщиком по организации и договору заказа.
//
Функция ДанныеЗаказа(Заказ) Экспорт

	Заказы = Новый Массив;
	Заказы.Добавить(Заказ);
	Запрос = ЗапросОплат(Заказы);
	Запрос.УстановитьПараметр("Заказ", Заказ);

	Данные = Новый Структура;
	Запрос.Текст = ТекстЗапросаТоваров();
	Данные.Вставить("Товары", Запрос.Выполнить().Выгрузить());
	Запрос.Текст = ТекстЗапросаПоступлений();
	Данные.Вставить("Поступления", Запрос.Выполнить().Выгрузить());
	Запрос.Текст = ТекстЗапросаПлатежей();
	Данные.Вставить("Оплаты", Запрос.Выполнить().Выгрузить());
	Запрос.Текст = ТекстЗапросаДокументов();
	Данные.Вставить("Документы", Запрос.Выполнить().Выгрузить());
	Запрос.Текст = ТекстЗапросаСальдо();
	Данные.Вставить("Сальдо", ТекстСальдо(Запрос.Выполнить().Выгрузить()));

	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	Данные.Поступления.Колонки.Добавить("Статус", ОписаниеСтроки);
	Данные.Документы.Колонки.Добавить("Вид", ОписаниеСтроки);
	Данные.Документы.Колонки.Добавить("Статус", ОписаниеСтроки);
	Для Каждого Строка Из Данные.Поступления Цикл
		Строка.Статус = ПредставлениеСтатусаДокумента(Строка.Проведен, Строка.ПометкаУдаления);
	КонецЦикла;
	Для Каждого Строка Из Данные.Документы Цикл
		Строка.Вид = Строка.Документ.Метаданные().Синоним;
		Строка.Статус = ПредставлениеСтатусаДокумента(Строка.Проведен, Строка.ПометкаУдаления);
	КонецЦикла;
	Возврат Данные;

КонецФункции

// Легенда индикатора в одну строку - в строку пагинатора под списком заказов.
//
// Возвращаемое значение:
//  Строка - «поставка · оплата: ○ нет ◐ частично ● да».
//
Функция ЛегендаИндикатораСтрокой() Экспорт

	Возврат НСтр("ru = 'поставка · оплата:  ○ нет   ◐ частично   ● да'; fr = 'livraison · paiement :  ○ non   ◐ partiel   ● oui';
		|en = 'delivery · payment:  ○ no   ◐ partial   ● yes'; es = 'entrega · pago:  ○ no   ◐ parcial   ● sí'");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Число - верхняя граница размера страницы, пришедшего с клиента.
//
Функция МаксимумСтраницы()

	Возврат 200;

КонецФункции

// Возвращаемое значение:
//  Структура - строка таблицы «Заказы» формы.
//
Функция НоваяСтрокаЗаказа()

	Возврат Новый Структура("Заказ, Номер, Дата, Поставщик, Статус, Индикатор, ДатаПоставки, Сумма, Валюта, ЗаказКлиента,
		|Ответственный, ВидЗаказа");

КонецФункции

// Пакет: ВТЗаказы - заказы по отборам панели, ВТДвижения - заказано, пришло и остаток по регистру, ВТСтатусы -
// вычисляемый статус. «Пришло» - расход регистраторами поступлений и возвратов (у возврата количество уже
// отрицательное), а не нулевой остаток: строки, забранные другим заказом поставщику, - «перенесено». Условия отборов
// вставляются в текст только для заполненных отборов, параметры ставятся в запрос.
//
// Параметры:
//  Запрос - Запрос - запрос, которому ставятся параметры отборов.
//  Отборы - Структура - см. НовыеОтборы.
//
// Возвращаемое значение:
//  Строка - текст пакета.
//
Функция ТекстЗапросаСтатусов(Запрос, Отборы)

	Условия = Новый Массив;
	Если ТипЗнч(Отборы.Поставщик) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Отборы.Поставщик) Тогда
		Условия.Добавить("Заказы.Контрагент = &Поставщик");
		Запрос.УстановитьПараметр("Поставщик", Отборы.Поставщик);
	КонецЕсли;
	Если ТипЗнч(Отборы.Ответственный) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Отборы.Ответственный) Тогда
		Условия.Добавить("Заказы.Ответственный = &Ответственный");
		Запрос.УстановитьПараметр("Ответственный", Отборы.Ответственный);
	КонецЕсли;
	Если ТипЗнч(Отборы.ВидЗаказа) = Тип("ПеречислениеСсылка.ВидыЗаказовПоставщику") И ЗначениеЗаполнено(Отборы.ВидЗаказа) Тогда
		Условия.Добавить("Заказы.ВидЗаказа = &ВидЗаказа");
		Запрос.УстановитьПараметр("ВидЗаказа", Отборы.ВидЗаказа);
	Иначе
		Условия.Добавить("Заказы.ВидЗаказа <> ЗНАЧЕНИЕ(Перечисление.ВидыЗаказовПоставщику.Предварительный)");
	КонецЕсли;
	Если ТипЗнч(Отборы.ПериодПоставки) = Тип("СтандартныйПериод") Тогда
		Если ЗначениеЗаполнено(Отборы.ПериодПоставки.ДатаНачала) Тогда
			Условия.Добавить("Заказы.ДатаПоставки >= &НачалоПоставки");
			Запрос.УстановитьПараметр("НачалоПоставки", Отборы.ПериодПоставки.ДатаНачала);
		КонецЕсли;
		Если ЗначениеЗаполнено(Отборы.ПериодПоставки.ДатаОкончания) Тогда
			Условия.Добавить("Заказы.ДатаПоставки МЕЖДУ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 1) И &КонецПоставки");
			Запрос.УстановитьПараметр("КонецПоставки", Отборы.ПериодПоставки.ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Отборы.Товар) = Тип("СправочникСсылка.Номенклатура") И ЗначениеЗаполнено(Отборы.Товар) Тогда
		Условия.Добавить("Заказы.Ссылка В
		|			(ВЫБРАТЬ
		|				ТоварыОтбора.Ссылка КАК Ссылка
		|			ИЗ
		|				Документ.ЗаказПоставщику.ТЧТовары КАК ТоварыОтбора
		|			ГДЕ
		|				ТоварыОтбора.Номенклатура = &Товар)");
		Запрос.УстановитьПараметр("Товар", Отборы.Товар);
	КонецЕсли;
	// Граница просрочки берётся при каждом чтении страницы, а не при открытии формы: после полуночи статус не отстаёт.
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));

	Текст =
	"ВЫБРАТЬ
	|	Заказы.Ссылка КАК Ссылка,
	|	Заказы.Дата КАК Дата,
	|	Заказы.ДатаПоставки КАК ДатаПоставки,
	|	Заказы.Проведен КАК Проведен,
	|	Заказы.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Заказы
	|ГДЕ
	|	&УсловиеЗаказов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Движения.ЗаказПоставщику КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Движения.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Заказано,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И (Движения.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ИЛИ Движения.Регистратор ССЫЛКА Документ.ВозвратПоставщику)
	|				ТОГДА Движения.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Пришло,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Движения.Количество
	|			ИНАЧЕ -Движения.Количество
	|		КОНЕЦ) КАК Остаток
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Движения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК ЗаказыДвижений
	|		ПО Движения.ЗаказПоставщику = ЗаказыДвижений.Ссылка
	|ГДЕ
	|	Движения.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.ЗаказПоставщику
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|ВЫБРАТЬ
	|	Заказы.Ссылка КАК Ссылка,
	|	Заказы.Дата КАК Дата,
	|	ЕСТЬNULL(Движения.Заказано, 0) КАК Заказано,
	|	ЕСТЬNULL(Движения.Пришло, 0) КАК Пришло,
	|	ВЫБОР
	|		КОГДА Заказы.ПометкаУдаления
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.Отменен)
	|		КОГДА НЕ Заказы.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.Черновик)
	|		КОГДА ЕСТЬNULL(Движения.Заказано, 0) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.ОжидаетПоставки)
	|		КОГДА ЕСТЬNULL(Движения.Остаток, 0) <= 0
	|				И ЕСТЬNULL(Движения.Пришло, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.Поступил)
	|		КОГДА ЕСТЬNULL(Движения.Остаток, 0) <= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.Перенесен)
	|		КОГДА Заказы.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
	|				И Заказы.ДатаПоставки < &НачалоДня
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.Просрочен)
	|		КОГДА ЕСТЬNULL(Движения.Пришло, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.ЧастичноПоступил)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщику.ОжидаетПоставки)
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТСтатусы
	|ИЗ
	|	ВТЗаказы КАК Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвижения КАК Движения
	|		ПО Заказы.Ссылка = Движения.Заказ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статус";
	// Условия подставляются на место параметра-заглушки: текст запроса остаётся разбираемым конструктором.
	УсловиеЗаказов = СтрСоединить(Условия, "
		|	И ");
	Возврат СтрЗаменить(Текст, "&УсловиеЗаказов", УсловиеЗаказов);

КонецФункции

// Запрос с временными таблицами оплат по заказам: ВТПоступления - проведённые поступления заказов в основной валюте за
// вычетом проведённых возвратов поставщику по ним (иначе рассчитанный заказ с возвратом остался бы «оплачен частично»),
// ВТПокрытие - доли поступлений в проведённых налоговых накладных покупки, ВТПлатежи - платежи поставщику по
// поступлениям и накладным (списание - плюс, возврат денег - минус), ВТОплатыПоступлений - оплачено по поступлению:
// свои платежи плюс доля платежей прямо на накладную.
//
// Параметры:
//  Заказы - Массив из ДокументСсылка.ЗаказПоставщику - заказы.
//
// Возвращаемое значение:
//  Запрос - запрос с менеджером временных таблиц.
//
Функция ЗапросОплат(Заказы)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Заказы", Заказы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Возвраты.Основание КАК Поступление,
	|	СУММА(ВЫРАЗИТЬ(Возвраты.Сумма * ВЫБОР
	|				КОГДА Возвраты.КурсВалюты > 0
	|					ТОГДА Возвраты.КурсВалюты
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Сумма
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	Документ.ВозвратПоставщику КАК Возвраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступленияВозвратов
	|		ПО Возвраты.Основание = ПоступленияВозвратов.Ссылка
	|ГДЕ
	|	Возвраты.Проведен
	|	И ПоступленияВозвратов.Основание В (&Заказы)
	|
	|СГРУППИРОВАТЬ ПО
	|	Возвраты.Основание
	|;
	|
	|ВЫБРАТЬ
	|	Поступления.Ссылка КАК Поступление,
	|	Поступления.Основание КАК Заказ,
	|	Поступления.СуммаРегл - ЕСТЬNULL(ВозвратыПоступлений.Сумма, 0) КАК Сумма
	|ПОМЕСТИТЬ ВТПоступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвраты КАК ВозвратыПоступлений
	|		ПО Поступления.Ссылка = ВозвратыПоступлений.Поступление
	|ГДЕ
	|	Поступления.Основание В (&Заказы)
	|	И Поступления.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Поступление
	|;
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Накладная
	|ПОМЕСТИТЬ ВТНакладныеВсе
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧТовары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоступления КАК ПоступленияТоваров
	|		ПО Товары.ПоступлениеТовара = ПоступленияТоваров.Поступление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧУслуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоступления КАК ПоступленияУслуг
	|		ПО Услуги.ПоступлениеТовара = ПоступленияУслуг.Поступление
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НакладныеВсе.Накладная КАК Накладная
	|ПОМЕСТИТЬ ВТНакладные
	|ИЗ
	|	ВТНакладныеВсе КАК НакладныеВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НалоговаяНакладнаяПокупка КАК Накладные
	|		ПО НакладныеВсе.Накладная = Накладные.Ссылка
	|ГДЕ
	|	Накладные.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Накладная
	|;
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Накладная,
	|	Товары.ПоступлениеТовара КАК Поступление,
	|	Товары.СуммаСНДС КАК Сумма
	|ПОМЕСТИТЬ ВТСтрокиНакладныхВсе
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧТовары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладные КАК НакладныеТоваров
	|		ПО Товары.Ссылка = НакладныеТоваров.Накладная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.Ссылка,
	|	Услуги.ПоступлениеТовара,
	|	Услуги.СуммаСНДС
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧУслуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладные КАК НакладныеУслуг
	|		ПО Услуги.Ссылка = НакладныеУслуг.Накладная
	|;
	|
	|ВЫБРАТЬ
	|	СтрокиВсе.Накладная КАК Накладная,
	|	СтрокиВсе.Поступление КАК Поступление,
	|	СУММА(СтрокиВсе.Сумма) КАК Покрытие
	|ПОМЕСТИТЬ ВТСтрокиНакладных
	|ИЗ
	|	ВТСтрокиНакладныхВсе КАК СтрокиВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиВсе.Накладная,
	|	СтрокиВсе.Поступление
	|;
	|
	|ВЫБРАТЬ
	|	СтрокиИтог.Накладная КАК Накладная,
	|	СУММА(СтрокиИтог.Покрытие) КАК Покрытие
	|ПОМЕСТИТЬ ВТИтогиНакладных
	|ИЗ
	|	ВТСтрокиНакладных КАК СтрокиИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиИтог.Накладная
	|;
	|
	|ВЫБРАТЬ
	|	Строки.Накладная КАК Накладная,
	|	Строки.Поступление КАК Поступление,
	|	Строки.Покрытие КАК Покрытие,
	|	Итоги.Покрытие КАК ВсегоПокрыто
	|ПОМЕСТИТЬ ВТПокрытие
	|ИЗ
	|	ВТСтрокиНакладных КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИтогиНакладных КАК Итоги
	|		ПО Строки.Накладная = Итоги.Накладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоступления КАК ПоступленияПокрытия
	|		ПО Строки.Поступление = ПоступленияПокрытия.Поступление
	|;
	|
	|ВЫБРАТЬ
	|	ПоступленияОплат.Поступление КАК Объект
	|ПОМЕСТИТЬ ВТОбъектыОплат
	|ИЗ
	|	ВТПоступления КАК ПоступленияОплат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НакладныеОплат.Накладная
	|ИЗ
	|	ВТНакладные КАК НакладныеОплат
	|;
	|
	|ВЫБРАТЬ
	|	Касса.Период КАК Период,
	|	Касса.Регистратор КАК Регистратор,
	|	Касса.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР
	|		КОГДА Касса.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|			ТОГДА -Касса.СуммаОборот
	|		ИНАЧЕ Касса.СуммаОборот
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВТПлатежи
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДокументПродажи В
	|				(ВЫБРАТЬ
	|					ОбъектыОплат.Объект КАК Объект
	|				ИЗ
	|					ВТОбъектыОплат КАК ОбъектыОплат)) КАК Касса
	|;
	|
	|ВЫБРАТЬ
	|	Доли.Поступление КАК Поступление,
	|	СУММА(Доли.Оплачено) КАК Оплачено
	|ПОМЕСТИТЬ ВТОплатыПоступлений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступленияПлатежей.Поступление КАК Поступление,
	|		Платежи.Сумма КАК Оплачено
	|	ИЗ
	|		ВТПлатежи КАК Платежи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоступления КАК ПоступленияПлатежей
	|			ПО Платежи.ДокументПродажи = ПоступленияПлатежей.Поступление
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДолиПокрытия.Поступление,
	|		ВЫБОР
	|			КОГДА ДолиПокрытия.ВсегоПокрыто = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(Платежи.Сумма * ДолиПокрытия.Покрытие / ДолиПокрытия.ВсегоПокрыто КАК ЧИСЛО(15, 2))
	|		КОНЕЦ
	|	ИЗ
	|		ВТПлатежи КАК Платежи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПокрытие КАК ДолиПокрытия
	|			ПО Платежи.ДокументПродажи = ДолиПокрытия.Накладная) КАК Доли
	|
	|СГРУППИРОВАТЬ ПО
	|	Доли.Поступление";
	Запрос.Выполнить();
	Возврат Запрос;

КонецФункции

// Возвращаемое значение:
//  Строка - строки заказа &Заказ: заказано по строке, пришло поступлениями за вычетом возвратов, остаток.
//
Функция ТекстЗапросаТоваров()

	Возврат
	"ВЫБРАТЬ
	|	Движения.Номенклатура КАК Номенклатура,
	|	Движения.Характеристика КАК Характеристика,
	|	Движения.КодСтроки КАК КодСтроки,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И (Движения.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ИЛИ Движения.Регистратор ССЫЛКА Документ.ВозвратПоставщику)
	|				ТОГДА Движения.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Пришло,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Движения.Количество
	|			ИНАЧЕ -Движения.Количество
	|		КОНЕЦ) КАК Осталось
	|ПОМЕСТИТЬ ВТДвиженияСтрок
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Движения
	|ГДЕ
	|	Движения.Активность
	|	И Движения.ЗаказПоставщику = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Номенклатура,
	|	Движения.Характеристика,
	|	Движения.КодСтроки
	|;
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Заказано,
	|	ЕСТЬNULL(Движения.Пришло, 0) КАК Пришло,
	|	ВЫБОР
	|		КОГДА Заказы.Проведен
	|			ТОГДА ЕСТЬNULL(Движения.Осталось, 0)
	|		ИНАЧЕ Товары.Количество
	|	КОНЕЦ КАК Осталось,
	|	Товары.Цена КАК Цена,
	|	Товары.СуммаСНДС КАК Сумма,
	|	Товары.Продукция КАК Продукция
	|ИЗ
	|	Документ.ЗаказПоставщику.ТЧТовары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказы
	|		ПО Товары.Ссылка = Заказы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияСтрок КАК Движения
	|		ПО Товары.Номенклатура = Движения.Номенклатура
	|			И Товары.Характеристика = Движения.Характеристика
	|			И Товары.КодСтроки = Движения.КодСтроки
	|ГДЕ
	|	Товары.Ссылка = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

КонецФункции

// Возвращаемое значение:
//  Строка - строки поступлений по заказу &Заказ, в том числе черновиков и помеченных.
//
Функция ТекстЗапросаПоступлений()

	Возврат
	"ВЫБРАТЬ
	|	Поступления.Ссылка КАК Документ,
	|	Поступления.Дата КАК Дата,
	|	Поступления.НомерВходящегоДокумента КАК НомерНакладной,
	|	Поступления.ДатаВходящегоДокумента КАК ДатаНакладной,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаСНДС КАК Сумма,
	|	Поступления.Проведен КАК Проведен,
	|	Поступления.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Поступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК Товары
	|		ПО Поступления.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Поступления.Основание = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поступления.Дата,
	|	Поступления.Ссылка,
	|	Товары.НомерСтроки";

КонецФункции

// Возвращаемое значение:
//  Строка - платежи поставщику по поступлениям заказа и по налоговым накладным, покрывающим эти поступления.
//
Функция ТекстЗапросаПлатежей()

	Возврат
	"ВЫБРАТЬ
	|	Платежи.Регистратор КАК Документ,
	|	Платежи.Период КАК Дата,
	|	Платежи.ДокументПродажи КАК Основание,
	|	Платежи.Сумма КАК Сумма
	|ИЗ
	|	ВТПлатежи КАК Платежи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";

КонецФункции

// Возвращаемое значение:
//  Строка - документы цепочки заказа &Заказ: сам заказ, поступления, возвраты по ним, налоговые накладные и платежи.
//
Функция ТекстЗапросаДокументов()

	Возврат
	"ВЫБРАТЬ
	|	Заказы.Ссылка КАК Документ,
	|	Заказы.Номер КАК Номер,
	|	Заказы.Дата КАК Дата,
	|	Заказы.Сумма КАК Сумма,
	|	Заказы.Проведен КАК Проведен,
	|	Заказы.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка = &Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Поступления.Ссылка,
	|	Поступления.Номер,
	|	Поступления.Дата,
	|	Поступления.Сумма,
	|	Поступления.Проведен,
	|	Поступления.ПометкаУдаления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Поступления
	|ГДЕ
	|	Поступления.Основание = &Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Возвраты.Ссылка,
	|	Возвраты.Номер,
	|	Возвраты.Дата,
	|	Возвраты.Сумма,
	|	Возвраты.Проведен,
	|	Возвраты.ПометкаУдаления
	|ИЗ
	|	Документ.ВозвратПоставщику КАК Возвраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступленияВозвратов
	|		ПО Возвраты.Основание = ПоступленияВозвратов.Ссылка
	|ГДЕ
	|	ПоступленияВозвратов.Основание = &Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Накладные.Ссылка,
	|	Накладные.Номер,
	|	Накладные.Дата,
	|	Накладные.Сумма,
	|	Накладные.Проведен,
	|	Накладные.ПометкаУдаления
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка КАК Накладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНакладные КАК НакладныеЗаказа
	|		ПО Накладные.Ссылка = НакладныеЗаказа.Накладная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Списания.Ссылка,
	|	Списания.Номер,
	|	Списания.Дата,
	|	Списания.Сумма,
	|	Списания.Проведен,
	|	Списания.ПометкаУдаления
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК Списания
	|ГДЕ
	|	Списания.Ссылка В
	|			(ВЫБРАТЬ
	|				ПлатежиСписаний.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТПлатежи КАК ПлатежиСписаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расходники.Ссылка,
	|	Расходники.Номер,
	|	Расходники.Дата,
	|	Расходники.Сумма,
	|	Расходники.Проведен,
	|	Расходники.ПометкаУдаления
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК Расходники
	|ГДЕ
	|	Расходники.Ссылка В
	|			(ВЫБРАТЬ
	|				ПлатежиРасходников.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТПлатежи КАК ПлатежиРасходников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступленияДенег.Ссылка,
	|	ПоступленияДенег.Номер,
	|	ПоступленияДенег.Дата,
	|	ПоступленияДенег.Сумма,
	|	ПоступленияДенег.Проведен,
	|	ПоступленияДенег.ПометкаУдаления
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступленияДенег
	|ГДЕ
	|	ПоступленияДенег.Ссылка В
	|			(ВЫБРАТЬ
	|				ПлатежиПоступлений.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТПлатежи КАК ПлатежиПоступлений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Приходники.Ссылка,
	|	Приходники.Номер,
	|	Приходники.Дата,
	|	Приходники.Сумма,
	|	Приходники.Проведен,
	|	Приходники.ПометкаУдаления
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК Приходники
	|ГДЕ
	|	Приходники.Ссылка В
	|			(ВЫБРАТЬ
	|				ПлатежиПриходников.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТПлатежи КАК ПлатежиПриходников)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";

КонецФункции

// Возвращаемое значение:
//  Строка - остаток расчётов с поставщиком по организации, контрагенту и договору заказа &Заказ.
//
Функция ТекстЗапросаСальдо()

	Возврат
	"ВЫБРАТЬ
	|	Расчеты.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
	|			,
	|			(Организация, Контрагент, Договор) В
	|				(ВЫБРАТЬ
	|					Заказы.Организация КАК Организация,
	|					Заказы.Контрагент КАК Контрагент,
	|					Заказы.Договор КАК Договор
	|				ИЗ
	|					Документ.ЗаказПоставщику КАК Заказы
	|				ГДЕ
	|					Заказы.Ссылка = &Заказ)) КАК Расчеты";

КонецФункции

// Параметры:
//  Статус   - ПеречислениеСсылка.СтатусыЗаказовПоставщику - статус заказа.
//  Заказано - Число - заказано по проведённому заказу.
//  Пришло   - Число - пришло поступлениями за вычетом возвратов.
//
// Возвращаемое значение:
//  Строка - кружок поставки: ○ ничего, ◐ часть, ● всё.
//
Функция КружокПоставки(Статус, Заказано, Пришло)

	Если Статус = Перечисления.СтатусыЗаказовПоставщику.Черновик
		Или Статус = Перечисления.СтатусыЗаказовПоставщику.Отменен
		Или Пришло <= 0 Тогда
		Кружок = КружокНет();
	ИначеЕсли Пришло >= Заказано Или Статус = Перечисления.СтатусыЗаказовПоставщику.Поступил Тогда
		// «Поступил» и при остатке, перенесённом в другой заказ: кружок совпадает со статусом.
		Кружок = КружокДа();
	Иначе
		Кружок = КружокЧастично();
	КонецЕсли;
	Возврат Кружок;

КонецФункции

// Параметры:
//  Оплата - Структура, Неопределено - см. ОплатыЗаказов, значение соответствия.
//
// Возвращаемое значение:
//  Строка - кружок оплаты поступлений: ○ нет поступлений или оплат, ◐ часть, ● всё.
//
Функция КружокОплаты(Оплата)

	Если Оплата = Неопределено Или Оплата.СуммаПоступлений <= 0 Или Оплата.Оплачено <= 0 Тогда
		Кружок = КружокНет();
	ИначеЕсли Оплата.Оплачено >= Оплата.СуммаПоступлений Тогда
		Кружок = КружокДа();
	Иначе
		Кружок = КружокЧастично();
	КонецЕсли;
	Возврат Кружок;

КонецФункции

Функция КружокНет()

	Возврат "○";

КонецФункции

Функция КружокЧастично()

	Возврат "◐";

КонецФункции

Функция КружокДа()

	Возврат "●";

КонецФункции

// Параметры:
//  Остатки - ТаблицаЗначений - колонка Сумма: остатки расчётов с поставщиком по договору заказа.
//
// Возвращаемое значение:
//  Строка - «Долг поставщику: …», «Аванс поставщику: …» или «Расчёты закрыты».
//
Функция ТекстСальдо(Остатки)

	Сумма = Остатки.Итог("Сумма");
	// Долг перед поставщиком в регистре - отрицательный остаток, аванс - положительный (см. ТестыДокументов,
	// ПроверитьДолгПоставщику).
	Если Сумма < 0 Тогда
		Шаблон = НСтр("ru = 'Долг поставщику по договору заказа: %1'; fr = 'Dette envers le fournisseur au titre du contrat : %1';
			|en = 'Owed to the supplier under the order contract: %1'; es = 'Deuda con el proveedor según el contrato: %1'");
		Текст = СтрШаблон(Шаблон, Формат(-Сумма, "ЧДЦ=2"));
	ИначеЕсли Сумма > 0 Тогда
		Шаблон = НСтр("ru = 'Аванс поставщику по договору заказа: %1'; fr = 'Avance au fournisseur au titre du contrat : %1';
			|en = 'Advance to the supplier under the order contract: %1'; es = 'Anticipo al proveedor según el contrato: %1'");
		Текст = СтрШаблон(Шаблон, Формат(Сумма, "ЧДЦ=2"));
	Иначе
		Текст = НСтр("ru = 'Расчёты с поставщиком по договору заказа закрыты'; fr = 'Comptes avec le fournisseur soldés';
			|en = 'Supplier account under the order contract is settled'; es = 'Cuentas con el proveedor saldadas'");
	КонецЕсли;
	Возврат Текст;

КонецФункции

// Параметры:
//  Проведен        - Булево - документ проведён.
//  ПометкаУдаления - Булево - документ помечен на удаление.
//
// Возвращаемое значение:
//  Строка - статус документа на языке пользователя.
//
Функция ПредставлениеСтатусаДокумента(Проведен, ПометкаУдаления)

	Если ПометкаУдаления Тогда
		Текст = НСтр("ru = 'Помечен на удаление'; fr = 'Marqué pour suppression'; en = 'Marked for deletion';
			|es = 'Marcado para eliminar'");
	ИначеЕсли Проведен Тогда
		Текст = НСтр("ru = 'Проведён'; fr = 'Validé'; en = 'Posted'; es = 'Contabilizado'");
	Иначе
		Текст = НСтр("ru = 'Черновик'; fr = 'Brouillon'; en = 'Draft'; es = 'Borrador'");
	КонецЕсли;
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
